# Explore Snow Survey Data

In [4]:
import pandas as pd 
import numpy as np

# Read in snow survey data
df = pd.read_csv('ASDN_csv/ASDN_Snow_survey.csv')
df_site = pd.read_csv('ASDN_csv/site.csv')
df_pers = pd.read_csv('ASDN_csv/personnel.csv')

In [5]:
df_pers.head()

       Abbreviation                     Name
0        agottesman          Aaron Gottesman
1         asterling            Abby Sterling
2          abradley             Adam Bradley
3          akneidel             Alan Kneidel
4  akataluk-primeau  Alannah Kataluk-Primeau

In [2]:
df_site.head()

,Code,Site name,Location,Latitude,Longitude,Total_Study_Plot_Area_(ha)
0,barr,Barrow,"Alaska, USA",71.3,-156.6,220.4
1,burn,Burntpoint Creek,"Ontario, Canada",55.2,-84.3,63.0
2,bylo,Bylot Island,"Nunavut, Canada",73.2,-80.0,723.6
3,cakr,Cape Krusenstern,"Alaska, USA",67.1,-163.5,54.1
4,cari,Canning River Delta,"Alaska, USA",70.1,-145.8,722.0

In [3]:
df.head()

,Site,Year,Date,Plot,Location,Snow_cover,Water_cover,Land_cover,Total_cover,Observer,Notes
0,barr,2011,2011-05-29,brw1,b10,90.0,0.0,10.0,100.0,adoll,NaN
1,barr,2011,2011-05-29,brw1,b12,100.0,0.0,0.0,100.0,adoll,NaN
2,barr,2011,2011-05-29,brw1,b2,90.0,0.0,10.0,100.0,adoll,NaN
3,barr,2011,2011-05-29,brw1,b4,100.0,0.0,0.0,100.0,adoll,NaN
4,barr,2011,2011-05-29,brw1,b6,95.0,0.0,5.0,100.0,adoll,NaN

In [4]:
df.dtypes

Site            object
Year             int64
Date            object
Plot            object
Location        object
Snow_cover     float64
Water_cover    float64
Land_cover     float64
Total_cover    float64
Observer        object
Notes           object
dtype: object

In [5]:
df.describe()

               Year    Snow_cover   Water_cover    Land_cover  Total_cover
count  27936.000000  27936.000000  27936.000000  27936.000000      27936.0
mean    2012.354059     20.709828     17.280015     62.010157        100.0
std        1.248833     34.462748     22.983631     34.928292          0.0
min     2006.000000      0.000000      0.000000      0.000000        100.0
25%     2011.000000      0.000000      0.000000     30.000000        100.0
50%     2012.000000      0.000000     10.000000     70.000000        100.0
75%     2013.000000     30.000000     25.000000     95.000000        100.0
max     2014.000000    100.000000    100.000000    100.000000        100.0

In [6]:
df.isna().sum()

Site               0
Year               0
Date               0
Plot             154
Location           9
Snow_cover         0
Water_cover        0
Land_cover         0
Total_cover        0
Observer           0
Notes          27128
dtype: int64

In [6]:
df['Plot'].value_counts()

Plot
brw5         2197
brw1         2189
brw3         2184
brw2         2085
brw8         1483
7b           1000
5a           1000
7a            999
5b            996
1             974
3a            920
3b            917
brw0          788
2             740
brw6          722
9             680
south         647
north         646
7             640
5             560
10            520
6             520
21            360
11            360
8             320
3             320
12            280
22            240
4             240
east          213
taglu         190
all           180
central       162
fishb         147
fisha         140
3A            120
3B            120
camp           99
nepe           97
sepe           97
west           92
5A             80
7B             80
7A             80
5B             80
fish a         50
fish b         50
plotF          40
plotE          40
CNSC           25
gun range      25
nig lo         19
studyarea      19
nig up         10
Name: count, dtype: int64